# Задание №6
def v_func(*args):
    word = input('Введите слова: ')
    print(word.title())
    return
v_func()