# Задание №1
a = 'какая-то строка'
b = 5
print(a, b)
print(b)
c = str(input('Введите ваше имя: '))
print('Привет, ', c)
a = int(input('Введите любое целое число: '))
print('Ваше число: ', a)
b = float(input('Введите дробное число: '))
print('Ваше число: ', b)
print('Введенные данные: ', c, a, b)