# Задание №3
n = input('Введите целое число n: ')
n1 = n + n
n2 = n1 + n
n3 = (int(n) + int(n1) + int(n2))
print('Сумма n + nn + nnn: ', n3)